{"title":"Adverts - How do they work?","body":"\u003cp\u003eIf you asked me to define an advert. I would say an advert is a message designed to encourage viewers to take a particular action.  Now, what makes an advert effective? Simply having a message is not enough. I have learnt that positioning /placement matters a lot. Where you place the advert is the biggest factor that influences the effectiveness of an advert. Another factor that affects the effectiveness of an advert is frequency.\u003c!--more--\u003e\u003c/p\u003e\n\u003cp\u003eThink about it for a minute... How any times did you take an action based on an advert you saw for the first time? I am willing to bet that most of us didn't take any action the first time. However, after seeing the advert a couple of times, say 5 - 10 times, it begins to sink in, and then boom! the magic happens. The advertisers have succeeded in getting your attention.\u003c/p\u003e\n\u003cp\u003eI know this is true because I did a small experiment on my comedy site \u003ca href=\"https://www.google.com/webmasters/tools/external-links-domain-to-page?hl=en\u0026amp;siteUrl=http://www.naijalol.com/\u0026amp;bldomain=jakophite.com\"\u003ewww.naijalol.com\u003c/a\u003e where I wanted to promote my second website \u003ca href=\"http://www.naijamuuzic.com\"\u003ewww.naijamuuzic.com\u003c/a\u003e. First, I put an ad on the home page of NaijaLOL and displayed it to 80% of my visitors. I thought this was a good position for the advert but to my greatest surprise, I wasn't getting the kind of hit I expected from the advert. This got me questioning the advert's message. Like, was the message not clear enough? Was the ad just not just appealing enough? etc.\u003c/p\u003e\n\u003cp\u003eThen I decided to place the same ad with the same message on another page on NaijaLOL, this time I decided to place it on the page where users watched videos.. and boom! I started seeing activities and within the first day I saw 15 clicks compared to the 2 clicks I saw from the first advert.\u003c/p\u003e\n\u003cp\u003eThe lesson here is to embrace experiments when it comes to advertisement. If your ad is not working as you expect it to. Check the following things:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003ePosition - Is the ad placed on a page where visibility is high. In my case, I learnt that users don't spend any significant time on the home page. Instead they just find a video of interest and go straight to watching it. Most of the time spent on the home page is spent looking for an item of interest\u003c/li\u003e\n\u003cli\u003eFrequency - Am I displaying the ad frequent enough?\u003c/li\u003e\n\u003cli\u003eMessage - Is the message clear enough? Is it appealing?\u003c/li\u003e\n\u003c/ol\u003e"}